# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "d12frosted/emacs-plus"
tap "epk/epk"

# AWS-related
brew "awscli"

# DB-related
brew "sqlite"

# Standard tools
brew "coreutils"
brew "cmake"
brew "gcc"
brew "gnupg"
brew "grep"
brew "imagemagick"
brew "libgccjit"
brew "openssl@3"
brew "pandoc"
brew "pngpaste"
brew "shfmt"
brew "readline"
brew "xz"
brew "zlib"


# Useful commands
brew "bat"
brew "bottom"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"

# Git-related
brew "gh"
brew "git"
brew "git-crypt"

# Docker-related
cask "orbstack"

# HTTP-related
brew "curl"
brew "grpcurl"
brew "httpie"
brew "wget"

# JSON-related
brew "jq"

# TMUX-related
brew "tmux"
brew "tmuxp"

# Term-related
cask "iterm2"
brew "libvterm"
brew "pure"
brew "ranger"

# i3-lite for osx
cask "amethyst"

# Fonts
brew "fontconfig"
cask "font-sf-mono-nerd-font"

# Node-related
brew "fnm"

# Python-related
brew "pyenv"

# Browsers
brew "lynx"
cask "firefox"

# Editors
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom3-icon", "with-native-comp", "with-xwidgets"]
brew "neovim"
cask "neovide"

# GO-related
brew "delve"

# Other tools
brew "cmatrix"
brew "fastfetch"
brew "graphviz"
brew "hugo"
brew "shellcheck"
