# Taps
tap "d12frosted/emacs-plus"
tap "epk/epk"
tap "ankitpokhrel/jira-cli"
tap "bashhack/gitbak"

# AWS-related
brew "awscli"

# DB-related
brew "sqlite"

# Standard tools
brew "coreutils"
brew "cmake"
brew "gnupg"
brew "pinentry-mac"
brew "grep"
brew "imagemagick"
brew "ghostscript"
brew "openssl@3"
brew "pandoc"
brew "pngpaste"
brew "shfmt"
brew "readline"
brew "xz"
brew "zlib"


# Useful commands
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "htop"
brew "ripgrep"

# Git-related
brew "gh"
brew "git"
brew "git-crypt"
brew "bashhack/gitbak/gitbak"

# Docker-related
cask "orbstack"

# HTTP-related
brew "curl"
brew "grpcurl"
brew "httpie"
brew "wget"
brew "hey"

# JSON-related
brew "jq"

# TMUX-related
brew "tmux"
brew "tmuxp"

# Term-related
# cask "iterm2"
brew "libvterm"
brew "pure"
brew "ranger"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# i3-lite for osx


# Fonts
brew "fontconfig"
cask "font-sf-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Node-related
brew "fnm"

# Python-related
brew "pyenv"

# Browsers
cask "firefox"

# Editors
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom3-icon", "with-native-comp", "with-xwidgets"]

# GO-related
brew "delve"

# Lisp-related
brew "sbcl"

# C-related
brew "llvm"
brew "ccls"
brew "clang-format"

# Zig-related
brew "zig"
brew "zls"

# Other tools
brew "graphviz"
brew "hugo"
brew "shellcheck"
brew "ffmpeg"
brew "jira-cli"
