tap "d12frosted/emacs-plus"
tap "epk/epk"
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"
tap "viktomas/taps"
brew "bat"
brew "bottom"
brew "cmake"
brew "coreutils"
brew "curl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gitlint"
brew "graphviz"
brew "grep"
brew "grpcurl"
brew "gnupg"
brew "httpie"
brew "hugo"
brew "jq"
brew "neovim"
brew "pandoc"
brew "pngpaste"
brew "powerlevel10k"
brew "pyenv"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "tmux"
brew "wget"
brew "youtube-dl"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-doom3-icon", "with-native-comp", "with-xwidgets"]
brew "viktomas/taps/godu"
cask "amethyst"
cask "font-sf-mono-nerd-font"
cask "neovide"
cask "orbstack"
